my-app/server/__tests__/artillery/products/test2_foreignKeys/products_test_log.txt
Test run id: tfjdq_npxfd6qh49dndyp5c7hgg6edc9d4x_t66x
Phase started: Testing Products (index: 0, duration: 20s) 19:56:46(-0400)

Phase completed: Testing Products (index: 0, duration: 20s) 19:57:06(-0400)

--------------------------------------
Metrics for period to: 19:56:50(-0400) (width: 2.532s)
--------------------------------------

http.codes.200: ................................................................ 11
http.downloaded_bytes: ......................................................... 4700
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 15
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 653
  median: ...................................................................... 432.7
  p95: ......................................................................... 561.2
  p99: ......................................................................... 561.2
http.responses: ................................................................ 11
vusers.completed: .............................................................. 11
vusers.created: ................................................................ 15
vusers.created_by_name.Get product: ............................................ 2
vusers.created_by_name.Get products: ........................................... 3
vusers.created_by_name.Get related: ............................................ 7
vusers.created_by_name.Get styles: ............................................. 3
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 21.7
  max: ......................................................................... 687.1
  median: ...................................................................... 468.8
  p95: ......................................................................... 584.2
  p99: ......................................................................... 584.2


--------------------------------------
Metrics for period to: 19:57:00(-0400) (width: 9.598s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 3
http.codes.200: ................................................................ 31
http.downloaded_bytes: ......................................................... 19014
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 551
  median: ...................................................................... 320.6
  p95: ......................................................................... 507.8
  p99: ......................................................................... 539.2
http.responses: ................................................................ 31
vusers.completed: .............................................................. 31
vusers.created: ................................................................ 50
vusers.created_by_name.Get product: ............................................ 13
vusers.created_by_name.Get products: ........................................... 13
vusers.created_by_name.Get related: ............................................ 14
vusers.created_by_name.Get styles: ............................................. 10
vusers.failed: ................................................................. 3
vusers.session_length:
  min: ......................................................................... 9.2
  max: ......................................................................... 567.7
  median: ...................................................................... 340.4
  p95: ......................................................................... 518.1
  p99: ......................................................................... 561.2


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 19:57:18(-0400)
--------------------------------

errors.ETIMEDOUT: .............................................................. 55
http.codes.200: ................................................................ 45
http.downloaded_bytes: ......................................................... 24072
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 801
  median: ...................................................................... 383.8
  p95: ......................................................................... 550.1
  p99: ......................................................................... 658.6
http.responses: ................................................................ 45
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 100
vusers.created_by_name.Get product: ............................................ 23
vusers.created_by_name.Get products: ........................................... 26
vusers.created_by_name.Get related: ............................................ 32
vusers.created_by_name.Get styles: ............................................. 19
vusers.failed: ................................................................. 55
vusers.session_length:
  min: ......................................................................... 9.2
  max: ......................................................................... 813.6
  median: ...................................................................... 399.5
  p95: ......................................................................... 572.6
  p99: ......................................................................... 685.5