my-app/server/__tests__/artillery/products/test2_foreignKeys/qna_test_log.txt
Test run id: tzxkz_pxmddce5y3tbaphf7mj6raepb83px_x3fq
Phase started: Testing Questions and Answers (index: 0, duration: 20s) 19:58:58(-0400)

Phase completed: Testing Questions and Answers (index: 0, duration: 20s) 19:59:18(-0400)

--------------------------------------
Metrics for period to: 19:59:00(-0400) (width: 0.217s)
--------------------------------------

http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 5
vusers.created: ................................................................ 5
vusers.created_by_name.Get answers: ............................................ 1
vusers.created_by_name.Get questions: .......................................... 4


Warning: multiple batches of metrics for period 1689724730000 2023-07-18T23:58:50.000Z
--------------------------------------
Metrics for period to: 19:59:10(-0400) (width: 9.302s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 4
http.codes.200: ................................................................ 5
http.downloaded_bytes: ......................................................... 6250
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 4332
  max: ......................................................................... 7241
  median: ...................................................................... 4316.6
  p95: ......................................................................... 4583.6
  p99: ......................................................................... 4583.6
http.responses: ................................................................ 5
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 50
vusers.created_by_name.Get answers: ............................................ 23
vusers.created_by_name.Get questions: .......................................... 27
vusers.failed: ................................................................. 4
vusers.session_length:
  min: ......................................................................... 4352.2
  max: ......................................................................... 7251.4
  median: ...................................................................... 4403.8
  p95: ......................................................................... 4583.6
  p99: ......................................................................... 4583.6


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 19:59:30(-0400)
--------------------------------

errors.ETIMEDOUT: .............................................................. 93
http.codes.200: ................................................................ 7
http.downloaded_bytes: ......................................................... 8750
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 4332
  max: ......................................................................... 9008
  median: ...................................................................... 4583.6
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 8692.8
http.responses: ................................................................ 7
vusers.completed: .............................................................. 7
vusers.created: ................................................................ 100
vusers.created_by_name.Get answers: ............................................ 47
vusers.created_by_name.Get questions: .......................................... 53
vusers.failed: ................................................................. 93
vusers.session_length:
  min: ......................................................................... 4352.2
  max: ......................................................................... 9018.5
  median: ...................................................................... 4583.6
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 8692.8